<?php
/**
 * Файл за превод на български език.
 *
 * За повечето низове може да се използва масив, като стойността е ключ. Системата ще избере превода,
 * съответстващ на ключа. Ако не се намери съвпадение, ще бъде използван ключът "else". Това е полезно за множествени числа.
 *
 * Лицензирано с MIT лиценз.
 *
 * За пълната информация относно авторско право и лиценз, моля, вижте файла LICENSE.
 *
 * @author Реми Ланвин <remi@cloudconnected.fr>
 * @link https://github.com/rlanvin/php-rrule
 */
return array(
    'yearly' => array(
        '1' => 'годишно',
        'else' => 'на всеки %{interval} години'
    ),
    'monthly' => array(
        '1' => 'месечно',
        'else' => 'на всеки %{interval} месеца'
    ),
    'weekly' => array(
        '1' => 'седмично',
        '2' => 'всеки втори петък',
        'else' => 'на всеки %{interval} седмици'
    ),
    'daily' => array(
        '1' => 'дневно',
        '2' => 'всеки втори ден',
        'else' => 'на всеки %{interval} дни'
    ),
    'hourly' => array(
        '1' => 'на всеки час',
        'else' => 'на всеки %{interval} часа'
    ),
    'minutely' => array(
        '1' => 'на всеки минута',
        'else' => 'на всеки %{interval} минути'
    ),
    'secondly' => array(
        '1' => 'на всеки секунда',
        'else' => 'на всеки %{interval} секунди'
    ),
    'dtstart' => ', започвайки от %{date}',
    'timeofday' => ' в %{date}',
    'startingtimeofday' => ' започвайки в %{date}',
    'infinite' => ', завинаги',
    'until' => ', до %{date}',
    'count' => array(
        '1' => ', един път',
        'else' => ', %{count} пъти'
    ),
    'and' => 'и ',
    'x_of_the_y' => array(
        'yearly' => '%{x} от годината',
        'monthly' => '%{x} от месеца',
    ),
    'bymonth' => ' през %{months}',
    'months' => array(
        1 => 'януари',
        2 => 'февруари',
        3 => 'март',
        4 => 'април',
        5 => 'май',
        6 => 'юни',
        7 => 'юли',
        8 => 'август',
        9 => 'септември',
        10 => 'октомври',
        11 => 'ноември',
        12 => 'декември',
    ),
    'byweekday' => ' в %{weekdays}',
    'weekdays' => array(
        1 => 'понеделник',
        2 => 'вторник',
        3 => 'сряда',
        4 => 'четвъртък',
        5 => 'петък',
        6 => 'събота',
        7 => 'неделя',
    ),
    'nth_weekday' => array(
        '1' => 'първият %{weekday}',
        '2' => 'вторият %{weekday}',
        '3' => 'третият %{weekday}',
        'else' => '%{n}-ти %{weekday}'
    ),
    '-nth_weekday' => array(
        '-1' => 'последният %{weekday}',
        '-2' => 'предпоследният %{weekday}',
        '-3' => 'предпредпоследният %{weekday}',
        'else' => '%{n}-ти отзад %{weekday}'
    ),
    'byweekno' => array(
        '1' => ' през седмица %{weeks}',
        'else' => ' през седмици номер %{weeks}'
    ),
    'nth_weekno' => '%{n}',
    'bymonthday' => ' на %{monthdays}',
    'nth_monthday' => array(
        '1' => 'първият',
        '2' => 'вторият',
        '3' => 'третият',
        '21' => 'двадесет и първият',
        '22' => 'двадесет и вторият',
        '23' => 'двадесет и третият',
        '31' => 'тридесет и първият',
        'else' => '%{n}-тият'
    ),
    '-nth_monthday' => array(
        '-1' => 'последният ден',
        '-2' => 'предпоследният ден',
        '-3' => 'предпредпоследният ден',
        '-21' => 'двадесет и първият до последният ден',
        '-22' => 'двадесет и вторият до последният ден',
        '-23' => 'двадесет и третият до последният ден',
        '-31' => 'тридесет и първият до последният ден',
        'else' => '%{n}-тият до последният ден'
    ),
    'byyearday' => array(
        '1' => ' на %{yeardays} ден',
        'else' => ' на %{yeardays} дни'
    ),
    'nth_yearday' => array(
        '1' => 'първият',
        '2' => 'вторият',
        '3' => 'третият',
        'else' => '%{n}-тият'
    ),
    '-nth_yearday' => array(
        '-1' => 'последният',
        '-2' => 'предпоследният',
        '-3' => 'предпредпоследният',
        'else' => '%{n}-тият до последният'
    ),
    'byhour' => array(
        '1' => ' в час %{hours}',
        'else' => ' в часове %{hours}'
    ),
    'nth_hour' => '%{n}ч',
    'byminute' => array(
        '1' => ' в минута %{minutes}',
        'else' => ' в минути %{minutes}'
    ),
    'nth_minute' => '%{n}',
    'bysecond' => array(
        '1' => ' в секунда %{seconds}',
        'else' => ' в секунди %{seconds}'
    ),
    'nth_second' => '%{n}',
    'bysetpos' => ', но само %{setpos} инстанции от този сет',
    'nth_setpos' => array(
        '1' => 'първата',
        '2' => 'втората',
        '3' => 'третата',
        'else' => '%{n}-тата'
    ),
    '-nth_setpos' => array(
        '-1' => 'последната',
        '-2' => 'предпоследната',
        '-3' => 'предпредпоследната',
        'else' => '%{n}-тата до последната'
    )
);
